tests/golden/shallow_clone_verbose.dot
digraph {
	graph [rankdir=RL]
	HEAD [label=HEAD color="0.000 1.000 1.000" fillcolor="0.000 0.100 1.000" penwidth=2 style=filled]
	HEAD -> "refs/heads/main" [label=HEAD]
	"refs/heads/main" [label=main color="0.000 1.000 1.000" fillcolor="0.000 0.100 1.000" penwidth=2 style=filled]
	"refs/heads/main" -> c61edbef2405d779b6f3a7bd006e68f095e7ed87 [label=branch]
	c61edbef2405d779b6f3a7bd006e68f095e7ed87 [label="commit
c61ed" color="0.222 1.000 1.000" fillcolor="0.222 0.100 1.000" penwidth=2 style=filled]
	"54d114dcd54f55e58d8b7dff2a1963d0d807b490" [label="tree
54d11" color="0.444 1.000 1.000" fillcolor="0.444 0.100 1.000" penwidth=2 style=filled]
	c61edbef2405d779b6f3a7bd006e68f095e7ed87 -> "54d114dcd54f55e58d8b7dff2a1963d0d807b490" [label=tree]
	"47e5d40a50f8db1524f5308633ae3f0d1de58619" [label="blob
47e5d" color="0.556 1.000 1.000" fillcolor="0.556 0.100 1.000" penwidth=2 style=filled]
	"54d114dcd54f55e58d8b7dff2a1963d0d807b490" -> "47e5d40a50f8db1524f5308633ae3f0d1de58619" [label="file.txt"]
	c61edbef2405d779b6f3a7bd006e68f095e7ed87 -> "8fb8112ef48db44d2d05e1764e69d43c68e16cf7" [label=parent]
	"8fb8112ef48db44d2d05e1764e69d43c68e16cf7" [label="commit
8fb81" color="0.222 1.000 1.000" fillcolor="0.222 0.100 1.000" penwidth=2 style=filled]
	"71587d436d19a3bab16924de049d5aba0e7e154c" [label="tree
71587" color="0.444 1.000 1.000" fillcolor="0.444 0.100 1.000" penwidth=2 style=filled]
	"8fb8112ef48db44d2d05e1764e69d43c68e16cf7" -> "71587d436d19a3bab16924de049d5aba0e7e154c" [label=tree]
	c694117fd4e76c22ae04348c15861413019aa03b [label="blob
c6941" color="0.556 1.000 1.000" fillcolor="0.556 0.100 1.000" penwidth=2 style=filled]
	"71587d436d19a3bab16924de049d5aba0e7e154c" -> c694117fd4e76c22ae04348c15861413019aa03b [label="file.txt"]
}
