tests/golden/shallow_clone_verbose.mermaid
flowchart RL
    HEAD["HEAD"]
    refs_heads_main["main"]
    c61edbef2405d779b6f3a7bd006e68f095e7ed87["commit<br/>c61ed"]
    54d114dcd54f55e58d8b7dff2a1963d0d807b490["tree<br/>54d11"]
    47e5d40a50f8db1524f5308633ae3f0d1de58619["blob<br/>47e5d"]
    8fb8112ef48db44d2d05e1764e69d43c68e16cf7["commit<br/>8fb81"]
    71587d436d19a3bab16924de049d5aba0e7e154c["tree<br/>71587"]
    c694117fd4e76c22ae04348c15861413019aa03b["blob<br/>c6941"]
    HEAD --> refs_heads_main
    refs_heads_main --> c61edbef2405d779b6f3a7bd006e68f095e7ed87
    c61edbef2405d779b6f3a7bd006e68f095e7ed87 --> 54d114dcd54f55e58d8b7dff2a1963d0d807b490
    54d114dcd54f55e58d8b7dff2a1963d0d807b490 -->|"file.txt"| 47e5d40a50f8db1524f5308633ae3f0d1de58619
    c61edbef2405d779b6f3a7bd006e68f095e7ed87 --> 8fb8112ef48db44d2d05e1764e69d43c68e16cf7
    8fb8112ef48db44d2d05e1764e69d43c68e16cf7 --> 71587d436d19a3bab16924de049d5aba0e7e154c
    71587d436d19a3bab16924de049d5aba0e7e154c -->|"file.txt"| c694117fd4e76c22ae04348c15861413019aa03b
    style HEAD fill:#ffe5e5,stroke:#ff0000,stroke-width:2px
    style refs_heads_main fill:#ffe5e5,stroke:#ff0000,stroke-width:2px
    style c61edbef2405d779b6f3a7bd006e68f095e7ed87 fill:#f6ffe5,stroke:#aaff00,stroke-width:2px
    style 54d114dcd54f55e58d8b7dff2a1963d0d807b490 fill:#e5fff6,stroke:#00ffa9,stroke-width:2px
    style 47e5d40a50f8db1524f5308633ae3f0d1de58619 fill:#e5f6ff,stroke:#00a9ff,stroke-width:2px
    style 8fb8112ef48db44d2d05e1764e69d43c68e16cf7 fill:#f6ffe5,stroke:#aaff00,stroke-width:2px
    style 71587d436d19a3bab16924de049d5aba0e7e154c fill:#e5fff6,stroke:#00ffa9,stroke-width:2px
    style c694117fd4e76c22ae04348c15861413019aa03b fill:#e5f6ff,stroke:#00a9ff,stroke-width:2px
